app/controllers/members_controller.rb

  def create
    rank = Member.where(active: true).count + 1
    member = Member.new(name: member_params[:name], surname: member_params[:surname], email: member_params[:email],
                        birthday: member_params[:birthday], rank: rank, games_played: 0)
    member.save!
---
SELECT COUNT(*) FROM "members" WHERE "members"."active" = ?  [["active", 1]]
INSERT INTO "members" ("name", "surname", "email", "birthday", "games_played", "rank", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    member = Member.find(member_params[:id])
    member.update(name: member_params[:name], surname: member_params[:surname], email: member_params[:email],
                  birthday: member_params[:birthday])
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "members" SET "name" = ?, "surname" = ?, "email" = ?, "birthday" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["name", "Name"], ["surname", "Surname"], ["email", "email@email.com"], ["birthday", "23 M"], ["updated_at", "2021-10-13 15:52:59.372970"], ["id", 1]]

  def destroy
    member = Member.find(params[:id])
    rank = member.rank
    Member.where('rank > ?', rank).update_all('rank = rank - 1')
    member.update!(active: false)
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET rank = rank - 1 WHERE (rank > 3)
UPDATE "members" SET "active" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["active", 0], ["updated_at", "2021-10-14 14:59:04.706547"], ["id", 2]]

  def log_match
    if params[:match].present?
      first_member = Member.find(match_params[:first_member_id])
      second_member = Member.find(match_params[:second_member_id])
      winning_member = match_params[:winning_member_id]
      Match.create!(first_member_id: first_member.id, second_member_id: second_member.id,
                    winning_member_id: winning_member)
      first_member.games_played += 1
      second_member.games_played += 1
      case winning_member
      when '1'
        calculate_rank(first_member, second_member)
      when '2'
        calculate_rank(second_member, first_member)
      when '3'
        if (first_member.rank - second_member.rank).abs > 1
          if first_member.rank > second_member.rank
            first_member.rank -= 1
            Member.where(rank: first_member.rank).update(rank: first_member.rank + 1)
          else
            second_member.rank -= 1
            Member.where(rank: second_member.rank).update(rank: second_member.rank + 1)
          end
        end
      first_member.save!
      second_member.save!
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "matches" ("first_member_id", "second_member_id", "winning_member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_member_id", 1], ["second_member_id", 4], ["winning_member_id", 2], ["created_at", "2021-10-14 14:47:46.892292"], ["updated_at", "2021-10-14 14:47:46.892292"]]
SELECT "members".* FROM "members" WHERE "members"."rank" = ?  [["rank", 2]]
UPDATE "members" SET "games_played" = ?, "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["games_played", 3], ["rank", 2], ["updated_at", "2021-10-14 11:48:55.850485"], ["id", 3]]
SELECT "members".* FROM "members" WHERE "members"."rank" = ?  [["rank", 3]]
UPDATE "members" SET "games_played" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["games_played", 3], ["updated_at", "2021-10-14 14:58:01.291735"], ["id", 1]]
UPDATE "members" SET "games_played" = ?, "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["games_played", 1], ["rank", 3], ["updated_at", "2021-10-14 14:58:01.305152"], ["id", 3]]

  def show
    @members = Member.where(active: true).order(rank: :asc)
---
SELECT "members".* FROM "members" WHERE "members"."active" = ? ORDER BY "members"."rank" ASC  [["active", 1]]

  def calculate_rank(winner, loser)
    if winner.rank > loser.rank
      lower_rank = winner.rank
      higher_rank = loser.rank
      winner.rank = lower_rank - ((lower_rank - higher_rank) / 2)
      Member.where('rank >= ?', winner.rank).update_all('rank = rank + 1')
      loser.rank = higher_rank + 1
      Member.where(rank: loser.rank).update(rank: loser.rank - 1)
    end
    winner.save!
    loser.save!
---
UPDATE "members" SET rank = rank + 1 WHERE (rank >= 3)
SELECT "members".* FROM "members" WHERE "members"."rank" = ?  [["rank", 2]]
UPDATE "members" SET "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["rank", 1], ["updated_at", "2021-10-14 14:54:18.141295"], ["id", 2]]
UPDATE "members" SET "games_played" = ?, "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["games_played", 1], ["rank", 3], ["updated_at", "2021-10-14 14:54:22.547824"], ["id", 4]]
UPDATE "members" SET "games_played" = ?, "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["games_played", 1], ["rank", 2], ["updated_at", "2021-10-14 14:54:22.563573"], ["id", 1]]