app/models/match.rb

  def log_result
    first_member = Member.find(first_member_id)
    second_member = Member.find(second_member_id)
    winning_member = winning_member_id
    first_member.games_played += 1
    second_member.games_played += 1
    case winning_member
    when 1
      calculate_rank(first_member, second_member)
    when 2
      calculate_rank(second_member, first_member)
    when 3
      if (first_member.rank - second_member.rank).abs > 1
        if first_member.rank > second_member.rank
          first_member.rank -= 1
          Member.where(rank: first_member.rank).update(rank: first_member.rank + 1)
        else
          second_member.rank -= 1
          Member.where(rank: second_member.rank).update(rank: second_member.rank + 1)
        end
      end
      first_member.save!
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."rank" = ?  [["rank", 2]]
UPDATE "members" SET "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["rank", 3], ["updated_at", "2021-10-14 20:07:54.222083"], ["id", 1]]
SELECT "members".* FROM "members" WHERE "members"."rank" = ?  [["rank", 3]]
UPDATE "members" SET "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["rank", 4], ["updated_at", "2021-10-14 20:07:18.181474"], ["id", 5]]
UPDATE "members" SET "games_played" = ?, "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["games_played", 1], ["rank", 3], ["updated_at", "2021-10-14 20:07:18.212095"], ["id", 4]]

  def calculate_rank(winner, loser)
    if winner.rank > loser.rank
      lower_rank = winner.rank
      higher_rank = loser.rank
      winner.rank = lower_rank - ((lower_rank - higher_rank) / 2)
      Member.where('rank >= ?', winner.rank).update_all('rank = rank + 1')
      loser.rank = higher_rank + 1
      Member.where(rank: loser.rank).update(rank: loser.rank - 1)
    end
    winner.save!
---
SELECT "members".* FROM "members" WHERE "members"."rank" = ?  [["rank", 2]]
UPDATE "members" SET "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["rank", 1], ["updated_at", "2021-10-14 20:06:21.871366"], ["id", 2]]
UPDATE "members" SET "games_played" = ?, "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["games_played", 1], ["rank", 3], ["updated_at", "2021-10-14 20:06:21.893512"], ["id", 5]]
UPDATE "members" SET "games_played" = ?, "rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["games_played", 1], ["rank", 2], ["updated_at", "2021-10-14 20:06:21.902587"], ["id", 1]]