app/views/members/log_match.html.erb

    <%= f.label :first_member %><br>
    <%= f.collection_select :first_member_id, Member.where(active: true), :id, :name %>
---
SELECT "members".* FROM "members" WHERE "members"."active" = ?  [["active", 1]]

    <%= f.label :second_member %><br>
    <%= f.collection_select :second_member_id, Member.where(active: true), :id, :name %>
---
SELECT "members".* FROM "members" WHERE "members"."active" = ?  [["active", 1]]